#+TITLE: org-mode-prequel
#+AUTHOR: Tony Day
#+EMAIL: tonyday567 at gmail dot com
#+COLUMNS: %25ITEM %30tangle
#+PROPERTIES: tangle yes


#+begin_src emacs-lisp :tangle yes
(setq org-mode-user-lisp-path 
      (expand-file-name "src/org-mode/lisp" user-emacs-directory))
(setq org-user-agenda-files (quote ()))
(setq org-mode-user-contrib-lisp-path 
      (expand-file-name "src/org-mode/contrib/lisp" user-emacs-directory))
#+end_src

#+results:
: /Users/tonyday/.emacs.d/src/org-mode/contrib/lisp


- places where org-mode falls over
#+begin_src emacs-lisp :tangle no
  (setq org-directory "~/git/org")
  (setq org-default-notes-file "~/git/org/refile.org")
#+end_src

#+begin_src emacs-lisp :tangle yes
  (add-to-list 'Info-default-directory-list "~/git/org-mode/doc")
#+end_src

